<template>
  <div class="container-fluid">
      <p>
        Выберите категорию услуг
      </p>
    <div class="row flex-row flex-nowrap">
      <div class="card col-5 text-white bg-primary mb-3" style="max-width: 18rem;">
        <div class="card-header"> </div>
        <div class="card-body">
          <h5 class="card-title">Primary card title</h5>
          <p class="card-text">Some quick example text to build on the card title and make up the bulk of the card's content.</p>
        </div>
      </div>

      <div class="card col-5 text-white bg-primary mb-3" style="max-width: 18rem;">
        <div class="card-header"> </div>
        <div class="card-body">
          <h5 class="card-title">Primary card title</h5>
          <p class="card-text">Some quick example text to build on the card title and make up the bulk of the card's content.</p>
        </div>
      </div>

      <div class="card col-5 text-white bg-primary mb-3" style="max-width: 18rem;">
        <div class="card-header"> </div>
        <div class="card-body">
          <h5 class="card-title">Primary card title</h5>
          <p class="card-text">Some quick example text to build on the card title and make up the bulk of the card's content.</p>
        </div>
      </div>
    </div>

    <div class="row">
      <div class="card col-12 text-white bg-primary mb-3" style="min-width: 90%;">
        <div class="card-header"> </div>
        <div class="card-body">
          <h5 class="card-title">Primary card title</h5>
          <p class="card-text">Some quick example text to build on the card title and make up the bulk of the card's content.</p>
        </div>
      </div>
    </div>


    <p>Если вы будете совершать эту операцию каждый день, то через две недели вместо травы покажутся сорняки. Это — одна из тайн природы: отчего из самого лучшего семенного материала вместо травы вырастает какое-то буйное, колючее былье? Может быть, для того чтобы получился хороший газон, нужно сеять сорняки? Через три недели газон густо зарос чертополохом и всякой нечистью, ползучей либо уходящей корнями в землю на целый локоть. Станешь ее вырывать, — она обламывается у самого корешка либо захватывает с собой целую груду земли. Выходит так: чем гаже поросль, тем она сильней цепляется за жизнь.</p><p>Между тем в результате некоего таинственного химического процесса шлак дорожек превратился в самую мазкую, липкую глину, какую только можно себе представить.</p><p>Но так или иначе, сорняки из газонов нужно выпалывать. Полешь, полешь, оставляя позади будущий газон в виде голой желтой глины, какой она была в первый день творения. Только в двух-трех местечках проступает что-то вроде зеленоватой плесени, что-то зыбкое, реденькое, похожее на пушок. Сомнений нет, это травка. Ты ходишь вокруг нее на цыпочках, отгоняешь воробьев. А пока таращишь глаза на землю, уже распустились первые листочки на кустах крыжовника и красной смородины: весна всегда подкрадывается незаметно.</p><p>И твое отношение к окружающему изменилось. Идет дождь — ты говоришь, что он поливает сад; светит солнце — оно это делает не просто так, а освещает сад; наступает ночь, ты радуешься, что наступил отдых для сада.</p><p>Придет день, когда ты откроешь глаза и увидишь: сад стоит зеленый, высокая трава сверкает росой, из гущи розового куста выглядывают тяжелые темно-красные бутоны. А деревья разрослись, стоят развесистые, тенистые, с пышными кронами, дыша ароматной прелью в сыром полумраке. И ты уже не вспомнишь о нежном, голом, буром садике тех дней, о робком пушке первой травки, о скудном проклевывании первых листочков, обо всей этой глинистой, бедной, трогательной красоте только что разбитого сада…</p><a name="section_4" class="fb2-title"><p>Как получается садовод</p></a><p>Вопреки ожиданиям садовод получается не из семени, черенка, луковицы, клубня или путем прививки, а в результате опыта, под влиянием среды и природных условий.</p><p>В детстве я относился к отцовскому саду недоброжелательно, даже вредительски, так как мне запрещалось ходить по клумбам и рвать незрелые плоды.</p><p>Ну вот, как Адаму в раю было запрещено ходить по грядкам и срывать плоды с древа познания добра и зла, оттого что они были еще незрелые; но Адам — совсем как мы, дети, — нарвал себе незрелых плодов, за что и был изгнан из рая. И с тех пор плоды древа познания остаются и останутся впредь незрелыми.</p><p>Пока человек в цвете молодости, он думает, что цветы — это что-то такое, что вдевают себе в петлицу и преподносят девушкам. Он не имеет ни малейшего представления о том, что цветы — нечто зимующее, требующее окапывания, унавоживания, поливки, пересаживания, подрезки, подстрижки, подвязывания, удаления сорняков и плодников, засохших листьев, тлей и грибка. Вместо того чтобы перекапывать клумбы, он бегает за девушками, тешит свое тщеславие, пользуется благами жизни, которые созданы не им, — вообще ведет себя как разрушитель. Для того чтобы стать садоводом-любителем, нужно достичь известной зрелости, так сказать, отцовского возраста. Кроме того, нужно иметь свой сад. Разбить его обычно поручают садовнику-профессионалу, с тем чтобы ходить туда после работы — любоваться цветочками и слушать пенье птичек. Но в один прекрасный день захочется и самому посадить цветок: у меня так было раз с бессмертником. При этом — через какую-нибудь царапину или еще как — в кровь тебе попадет немножко земли, а с ней — нечто вроде инфекции, или отравы, — и стал человек отчаянным садоводом. Коготок увяз — всей птичке пропасть.</p>
  </div>
</template>

<script>

export default {
  components: {

  }
}
</script>

<style>
.container {
  margin: 0 auto;
  min-height: 100vh;
  display: flex;
  justify-content: center;
  align-items: center;
  text-align: center;
}

</style>
