<template>
  <div class="container-fluid">


    <p>А иногда садовод получается в результате заразы, занесенной от соседей. Увидел ты, скажем, что у них смолянка
      зацвела. “Черт возьми! — думаешь. — А почему бы ей не цвести и у меня? Еще лучше расцветет!” С этого момента
      садовод становится все больше и больше рабом своей страсти, питаемой дальнейшими успехами и подстегиваемой
      дальнейшими неудачами. В нем зарождается коллекционерский азарт, побуждающий его выращивать все растения по
      алфавиту — от Асаеn'ы до Zauschneri'и; а впоследствии развивается фанатизм специалиста, превращающий человека, до
      тех пор вполне вменяемого, в розомана, георгиномана или какого-нибудь другого исступленного маньяка…</p>
    <p>А иные, став жертвой страсти к декорированию, беспрестанно перестраивают и перепланировывают свой сад, подбирают
      оттенки, перегруппировывают кусты и, подстрекаемые так называемым творческим беспокойством, не дают ничему стоять
      и расти на своем месте. Пусть никто не думает, будто садоводство — занятие буколическое и располагающее к
      размышлениям. Это — ненасытная страсть, как все, за что ни возьмется человек обстоятельный.</p>
    <p>Скажу еще, как узнать настоящего садовода.</p>
    <p>— Обязательно приходите ко мне, — говорит он. — Я хочу показать вам свой сад.</p>
    <p>Вы пришли к нему, чтобы сделать ему приятное, и обнаруживаете его заднюю часть, воздвигающуюся где-то между
      многолетниками.</p>
    <p>— Иду, — кидает он через плечо. — Только посажу вот.</p>
    <p>— Ради бога, не беспокойтесь, — любезно отвечаете вы.</p>
    <p>Через какое-то время он, видимо, кончил сажать, во всяком случае выпрямился, испачкал вам руку и, весь сияя
      гостеприимством, говорит:</p>
    <p>— Пойдемте, я покажу вам. Садик небольшой, но… Минуту! — прерывает он сам себя и, наклонившись над куртиной,
      выдергивает несколько травинок. — Идем. Я покажу вам Dianthus Musalae. Что-то особенное… Господи, забыл здесь
      разрыхлить!</p>
    <p>Спохватившись, он опять начинает рыться в земле.</p>
    <p>Через четверть часа выпрямляется снова.</p>
    <p>— Да, да, — говорит он. — Я хотел показать вам свои колокольчики. Campanula Wilsonae. Это самые лучшие, какие
      только… Погодите, только подвяжу вот этот Delphinium…</p>
  </div>
</template>
